{"id": 0, "dialogue": [{"User": "I would like you to set the trigger channel to Department of Agriculture.", "Belief State": {"trigger_channel": "Department of Agriculture"}}]}
{"id": 0, "dialogue": [{"User": "I'd like to get notified when there’s a food safety issue.", "Belief State": {"trigger_channel": "Department of Agriculture", "trigger_title": "New open recall", "action_title": "Send me an email"}}, {"System": "Ok, I understand you want a notification about food safety issues. To set this up, could you tell me what specifically triggers this notification from the Department of Agriculture?", "User": "I need to be notified when the Department of Agriculture announces a new open recall. Also, please send me an email when that happens.", "Belief State": {"trigger_channel": "Department of Agriculture", "trigger_title": "New open recall", "action_title": "Send me an email"}}]}
{"id": 1, "dialogue": [{"User": "I would like you to play music.", "Belief State": {"action_title": "Play music"}}]}
{"id": 2, "dialogue": [{"User": "I would like information from Weather Underground.", "Belief State": {"trigger_channel": "Weather Underground"}}]}
{"id": 3, "dialogue": [{"User": "Can you tell me if there's anything new happening with the weather?", "Belief State": {"trigger_channel": "Weather Underground", "trigger_title": "Today's weather report", "action_channel": "Notifications"}}, {"System": "Ok, I understand you want a notification about the weather. But what specifically about the weather are you interested in?", "User": "I’d like a daily notification with today’s weather report from Weather Underground.", "Belief State": {"trigger_channel": "Weather Underground", "trigger_title": "Today's weather report", "action_channel": "Notifications"}}]}
{"id": 4, "dialogue": [{"User": "I'd like something done whenever there’s a new update somewhere and then share it on Twitter with an image.", "Belief State": {"trigger_title": "Any new item", "action_title": "Post a tweet with image"}}, {"System": "Ok, I understand you want to share updates on Twitter. But where are these updates coming from? Could you tell me which source should trigger this action?", "User": "The updates come from my RSS feed. So, monitor any new item in my RSS feed and then post a tweet with the image.", "Belief State": {"trigger_title": "Any new item", "action_title": "Post a tweet with image"}}]}
{"id": 0, "dialogue": [{"User": "I'd like to get notified when something new happens with agricultural data.", "Belief State": {}}, {"System": "Ok, I understand you want an email notification about agricultural data. Could you tell me what specifically about that data triggers this notification?", "User": "Notify me when new subsidy programs are announced by the Department of Agriculture.", "Belief State": {}}]}
{"id": 1, "dialogue": [{"User": "I'd like something to happen when my cooking app starts, and send a notification to my phone.", "Belief State": {}}, {"System": "Ok, I understand you want a notification on your phone when Cookit starts. But what triggers this event and where should the notification appear exactly?", "User": "The trigger is when the Cookit app starts on my Facebook account, and the notification must be sent to my Android Device.", "Belief State": {}}]}
{"id": 2, "dialogue": [{"User": "I want to receive tomorrow’s weather report via Gmail.", "Belief State": {"trigger_title": "Tomorrow's weather report", "action_channel": "Gmail"}}]}
{"id": 3, "dialogue": [{"User": "I want to receive today’s weather report.", "Belief State": {"trigger_title": "Today's weather report"}}]}
{"id": 4, "dialogue": [{"User": "I'd like something posted when an event happens.", "Belief State": {}}, {"User": "I would like you to post on Twitter.", "Belief State": {}}]}
{"id": 0, "dialogue": [{"User": "I'd like to get notified when something happens.", "Belief State": {}}, {"System": "Ok, I understand you want an email when a new photo is posted on Facebook with a specific hashtag. But what details about this email do you need?", "User": "Please send me an email with the link to the post and the hashtag used.", "Belief State": {"action_channel": "Email", "action_title": "Send me an email"}}]}
{"id": 1, "dialogue": [{"User": "I’d like something to happen when my cooking app starts up, and send a notification to my phone.", "Belief State": {}}, {"System": "Ok, I understand you want a notification on your phone when your cooking app starts. But could you tell me which application is triggering this event?", "User": "The trigger is happening within the Cookit app. And I’d like to send the notification to my Android Device.", "Belief State": {"trigger_title": "Cookit started", "action_channel": "Android Device"}}]}
{"id": 2, "dialogue": [{"User": "I want to receive tomorrow’s weather report via email.", "Belief State": {"trigger_channel": "Weather Underground", "trigger_title": "Tomorrow's weather report", "action_channel": "Gmail"}}]}
{"id": 3, "dialogue": [{"User": "I'd like to get a notification when something interesting happens with the weather.", "Belief State": {}}, {"User": "I would like to receive notifications from Weather Underground.", "Belief State": {"trigger_channel": "Weather Underground", "action_channel": "Notifications"}}]}
{"id": 4, "dialogue": [{"User": "I'd like something to happen when a new picture is uploaded. Maybe post about it somewhere?", "Belief State": {}}, {"System": "Ok, I understand you want to post a tweet with an image when a new photo is posted on Facebook with a hashtag. But what details should be included in the tweet itself?", "User": "The tweet should include the text from the original Facebook post and also the same image that was uploaded.", "Belief State": {"action_channel": "Twitter", "action_title": "Post a tweet with image"}}]}
